{"articles": [{"url": "https://www.financialexpress.com/brandwagon/ampere-electric-vehicles-becomes-official-ev-partner-of-royal-challengers-bangalore-for-the-upcoming-t20-league/3022581/", "title": "Ampere Electric Vehicles becomes official EV partner of Royal Challengers Bangalore for IPL 2023", "seendate": "20230326T130250Z", "socialimage": "https://www.financialexpress.com/wp-content/uploads/2023/03/Yourararaph-text-2023-03-26T170700.622.jpg", "domain": "financialexpress.com", "language": "ENGLISH", "isquote": 0, "sentence": "It is believed that this collaboration is in perfect sync with Ampere's commitment to lead India towards a greener future.", "context": "Ampere, the flagship electric two-wheeler brand from Greaves Electric Mobility Private Limited, (\"GEMPL\") has collaborated with Royal Challengers Bangalore as their official EV Partner for the upcoming season of the T20 League. It is believed that this collaboration is in perfect sync with Ampere's commitment to lead India towards a greener future. The team will showcase a distinctive jersey referred to as the 'Ampere Take Charge Squad' and will be made of 100% sustainable materials and upcycled scrap, the company claims."}, {"url": "https://www.livemint.com/companies/news/crompton-greaves-consumer-proposes-strategic-merger-with-butterfly-gandhimathi-appliances-11679833709591.html", "title": "Crompton Greaves Consumer proposes strategic merger with Butterfly Gandhimathi Appliances", "seendate": "20230326T130250Z", "socialimage": "https://www.livemint.com/lm-img/img/2023/03/26/600x338/crompton_1679833954056_1679833961670_1679833961670.jpg", "domain": "livemint.com", "language": "ENGLISH", "isquote": 0, "sentence": "Further, the merger is seen to unlock various revenue and cost synergies, and achieve economies of scale by pooling the combined resources and provide an impetus to grow across all parts of India.", "context": "We are confident that this will create significant value for all of our stakeholders.\" Further, the merger is seen to unlock various revenue and cost synergies, and achieve economies of scale by pooling the combined resources and provide an impetus to grow across all parts of India. Rangarajan Sriram, Managing Director – of Butterfly said that the proposed merger will enable Butterfly to better leverage the pan-India reach of Crompton, integrate more closely with Crompton's consumer appliances business, and tap cross-selling opportunities."}, {"url": "https://www.indiagazette.com/news/273671673/validity-of-fcra-licence-of-ngos-extended-till-sep-30", "title": "Validity of FCRA licence of NGOs extended till Sep 30", "seendate": "20230326T130249Z", "socialimage": "https://cdn.bignewsnetwork.com/ani1679823602.jpg", "domain": "indiagazette.com", "language": "ENGLISH", "isquote": 0, "sentence": "New Delhi [India], March 26 (ANI): The Centre has extended the validity of the Foreign Contribution (Regulation) Act (FCRA) registration of Non-Governmental Organisations (NGOs) for six more months till September 30, 2023.", "context": "New Delhi [India], March 26 (ANI): The Centre has extended the validity of the Foreign Contribution (Regulation) Act (FCRA) registration of Non-Governmental Organisations (NGOs) for six more months till September 30, 2023. \"This issues with the approval of the Competent Authority."}, {"url": "https://www.orissapost.com/japan-pm-kishidas-visit-to-ukraine-overshadows-xis-talks-with-putin-upsets-china/", "title": "Japan PM Kishidas visit to Ukraine overshadows Xis talks with Putin, upsets China", "seendate": "20230326T130249Z", "socialimage": "https://www.orissapost.com/wp-content/uploads/2023/03/Fumio-Kishida-2.jpg", "domain": "orissapost.com", "language": "ENGLISH", "isquote": 0, "sentence": "Beijing was caught by surprise as Kishida, who was on an official visit to New Delhi from March 19-21, entered Poland from India using a secretly chartered plane instead of the standard government aircraft, Japanese TV channel NHK reported.", "context": "Beijing: China Tuesday hit out at Japan after its Prime Minister Fumio Kishida made a surprise visit to Ukraine and overshadowed Chinese President Xi Jinping's meeting with his Russian counterpart Vladimir Putin in Moscow, saying Tokyo should do more to de-escalate the situation rather than aggravating it. Beijing was caught by surprise as Kishida, who was on an official visit to New Delhi from March 19-21, entered Poland from India using a secretly chartered plane instead of the standard government aircraft, Japanese TV channel NHK reported. The chartered plane left Tokyo's Haneda Airport at around 8 pm Sunday, about three hours before a government plane carrying Kishida departed for India."}, {"url": "https://zeenews.india.com/personal-finance/sbi-hdfc-banks-special-fd-scheme-check-fixed-deposits-plans-ending-on-march-31-2588082.html", "title": "SBI, HDFC Banks Special FD Scheme: Check Fixed Deposits Plans Ending on March 31", "seendate": "20230326T130249Z", "socialimage": "https://english.cdn.zeenews.com/sites/default/files/2023/03/26/1173872-untitled-design-2023-03-26t181347.280.jpg", "domain": "zeenews.india.com", "language": "ENGLISH", "isquote": 0, "sentence": "New Delhi: The recent interest rate hikes by the Reserve Bank of India might have taken your EMI burdens higher, but on the bright side, the FD rates have also improved.", "context": "New Delhi: The recent interest rate hikes by the Reserve Bank of India might have taken your EMI burdens higher, but on the bright side, the FD rates have also improved. Several banks have passed on the benefits of better FD returns to customers after the spate of key interest rate hikes by the central bank."}, {"url": "https://www.indiagazette.com/news/273671644/it-is-not-satyagraha-it-is-duragraha-bjp-poonawalla-hits-at-congress", "title": "It is not Satyagraha, it is Duragraha: BJPs Poonawalla hits at Congress", "seendate": "20230326T130248Z", "socialimage": "https://cdn.bignewsnetwork.com/ani1679821438.jpg", "domain": "indiagazette.com", "language": "ENGLISH", "isquote": 1, "sentence": "New Delhi [India], March 26 (ANI): BJP national spokesperson Shehzad Poonawalla on Sunday hit out at the Congress and said the \"Sankalp Satyagraha'\"", "context": "New Delhi [India], March 26 (ANI): BJP national spokesperson Shehzad Poonawalla on Sunday hit out at the Congress and said the \"Sankalp Satyagraha'\" launched by the party is in fact a \"Duragraha\""}, {"url": "https://www.centralasiatimes.com/news/273671849/anurag-thakur-congratulates-nitu-ghanghas-saweety-boora-for-clinching-top-prize-at-iba-women-world-boxing-chips", "title": "Anurag Thakur congratulates Nitu Ghanghas, Saweety Boora for clinching top prize at IBA Womens World Boxing Cships", "seendate": "20230326T130248Z", "socialimage": "https://cdn.bignewsnetwork.com/ani1679827604.jpg", "domain": "centralasiatimes.com", "language": "ENGLISH", "isquote": 0, "sentence": "New Delhi [India], March 26 (ANI): Union Sports Minister Anurag Thakur on Sunday congratulated boxers Saweety Boora and Nitu Ghanghas for clinching the world title at the ongoing IBA Women's World Boxing Championships on Saturday.", "context": "New Delhi [India], March 26 (ANI): Union Sports Minister Anurag Thakur on Sunday congratulated boxers Saweety Boora and Nitu Ghanghas for clinching the world title at the ongoing IBA Women's World Boxing Championships on Saturday. Scripting history, exuberant Indian pugilists Nitu Ghanghas and Saweety Boora were crowned as World Champions for the first time after registering contrasting victories in the finals of the IBA Women's World Boxing Championships at the Indira Gandhi Sports Complex here on Saturday."}, {"url": "https://www.bruneinews.net/news/273671941/bwf-sudirman-cup-india-draw-with-malaysia-chinese-taipei-australia-in-group-c", "title": "BWF Sudirman Cup: India draw with Malaysia, Chinese Taipei, Australia in Group C", "seendate": "20230326T130246Z", "socialimage": "https://cdn.bignewsnetwork.com/ani1679831225.jpg", "domain": "bruneinews.net", "language": "ENGLISH", "isquote": 0, "sentence": "By winning the bronze medal at the Badminton Asia Mixed Team Championships last month, India earned a spot in the Sudirman Cup in 2023.", "context": "The defending Commonwealth Games winners Satwiksairaj Rankireddy-Chirag Shetty, PV Sindhu, Lakshya Sen, and the rising women's doubles team of Gayatri Gopichand-Treesa Jolly will be counted on to lead India's challenge in Suzhou. By winning the bronze medal at the Badminton Asia Mixed Team Championships last month, India earned a spot in the Sudirman Cup in 2023. India will face Malaysia in the group round of the Badminton Asia Mixed Team Championships since the two nations have met before."}, {"url": "https://foreignaffairs.co.nz/2023/03/27/mil-osi-africa-president-ramaphosa-mourns-passing-of-ambassador-moolla/", "title": "MIL-OSI Africa: President Ramaphosa mourns passing of Ambassador Moolla", "seendate": "20230326T130245Z", "socialimage": "", "domain": "foreignaffairs.co.nz", "language": "ENGLISH", "isquote": 0, "sentence": "During his exile years, Mosie represented the ANC in India, Egypt and the World Peace Council in Helsinki, Finland.", "context": "He became a member of Umkhonto Wesizwe and received military training in the Union of Soviet Socialist Republics (USSR). During his exile years, Mosie represented the ANC in India, Egypt and the World Peace Council in Helsinki, Finland. With international relations experience and contribution to the Convention for a Democratic South Africa (CODESA) negotiations, Mosie was appointed by President Nelson Mandela to serve as South Africa's Ambassador to the Islamic Republic of Iran from 1995 to 1999."}, {"url": "https://www.singaporestar.com/news/273671940/duncan-taylor-black-bull-challenge-2023-chouhan-trails-leader-lorenzo-scalise-of-italy-by-two-shots", "title": "Duncan Taylor Black Bull Challenge 2023: Chouhan trails leader Lorenzo Scalise of Italy by two shots", "seendate": "20230326T130245Z", "socialimage": "https://cdn.bignewsnetwork.com/ani1679831214.jpg", "domain": "singaporestar.com", "language": "ENGLISH", "isquote": 0, "sentence": "Bengaluru (Karnataka)[India], March 26 (ANI): Italy's Lorenzo Scalise shot the third day's best score of seven-under 65 to take a two-shot lead at 15-under 201 at the Duncan Taylor Black Bull Challenge 2023 being played at the Karnataka Golf Association (KGA) course in Bengaluru.", "context": "Bengaluru (Karnataka)[India], March 26 (ANI): Italy's Lorenzo Scalise shot the third day's best score of seven-under 65 to take a two-shot lead at 15-under 201 at the Duncan Taylor Black Bull Challenge 2023 being played at the Karnataka Golf Association (KGA) course in Bengaluru. The big news for India was that Om Prakash Chouhan fired a 66 to zoom 11 spots to tied second at 13-under 203 and thus emerge as the highest-placed golfer from the host country at the event co-sanctioned by the Challenge Tour and PGTI."}, {"url": "https://www.indiagazette.com/news/273671872/guru-randhawa-harbhajan-singh-meet-rishabh-pant-wish-him-speedy-recovery-in-special-posts", "title": "Guru Randhawa, Harbhajan Singh meet Rishabh Pant, wish him speedy recovery in special posts", "seendate": "20230326T130244Z", "socialimage": "https://cdn.bignewsnetwork.com/ani1679830819.jpg", "domain": "indiagazette.com", "language": "ENGLISH", "isquote": 0, "sentence": "Mumbai (Maharashtra) [India], March 26 (ANI): Cricketer Rishabh Pant, who met with an accident in December last year seems to be recovering well.", "context": "Mumbai (Maharashtra) [India], March 26 (ANI): Cricketer Rishabh Pant, who met with an accident in December last year seems to be recovering well. Former Indian cricketers Harbhajan Singh, Suresh Raina and Sreesanth recently visited Pant's house."}, {"url": "https://www.goal.com/en/news/northern-ireland-vs-finland-where-to-watch-stream-tv-channel-kick-off-time/blt706289581b8746cc", "title": "Northern Ireland vs Finland: Where to watch the match online, live stream, TV channels & kick-off time", "seendate": "20230326T130243Z", "socialimage": "", "domain": "goal.com", "language": "ENGLISH", "isquote": 0, "sentence": "GOAL brings you details on how to watch the game on TV in the US, UK and India, and how to stream it live online.", "context": "Coach Michael O'Neill saw his men pick up a 2-0 win over San Marino in their Group H opener courtesy of a brace from Dion Charles, while Finland were on the wrong end of a 3-1 result against Denmark. GOAL brings you details on how to watch the game on TV in the US, UK and India, and how to stream it live online. Northern Ireland vs Finland date & kick-off time Game: Northern Ireland vs Finland Date: March 26, 2023 Kick-off: 2:45pm EDT, 7:45pm BST, 12:15am IST (Mar 27) Venue: Windsor Park, Belfast How to watch Northern Ireland vs Finland on TV & live stream online This page contains affiliate links."}, {"url": "https://www.financialexpress.com/industry/rcap-resolution-plan-hits-roadblock-as-bidders-upset-over-another-auction-plan/3022598/", "title": "RCap resolution plan hits roadblock as bidders upset over another auction plan", "seendate": "20230326T130242Z", "socialimage": "https://www.financialexpress.com/wp-content/uploads/2023/03/rcap-2.jpg", "domain": "financialexpress.com", "language": "ENGLISH", "isquote": 0, "sentence": "The Reserve Bank of India (RBI) had on November 29, 2021, superseded the board of Reliance Capital in view of payment defaults and serious governance issues.", "context": "Torrent approached the Supreme Court to seek a stay on the National Company Law Appellate Tribunal (NCLAT) order, but the apex court did not offer any relief to the company. The Reserve Bank of India (RBI) had on November 29, 2021, superseded the board of Reliance Capital in view of payment defaults and serious governance issues. The RBI appointed Nageswara Rao Y as the administrator in relation to the Corporate Insolvency Resolution Process (CIRP) of the firm."}, {"url": "https://timesofindia.indiatimes.com/life-style/fashion/buzz/ethical-philosophy-of-new-age-leather-goods/articleshow/99009173.cms", "title": "Ethical philosophy of new age leather goods", "seendate": "20230326T130240Z", "socialimage": "https://static.toiimg.com/photo/msid-99009173/99009173.jpg?20750", "domain": "timesofindia.indiatimes.com", "language": "ENGLISH", "isquote": 1, "sentence": "The Quorum was Behno's official partner for the evening, creatively tailored event in parallel to leather brands launch in india with theme \"homecoming\".", "context": "When we say global sensibility we mean mixing the cultures of two different sides and creating an experience with fashion, food and beverages which will awaken the senses of creativity for progressive like-minded people. The Quorum was Behno's official partner for the evening, creatively tailored event in parallel to leather brands launch in india with theme \"homecoming\". The food and beverages were based on the theme of the two cities Behno's founder belongs to - New York and Mumbai."}, {"url": "https://radio.wpsu.org/people/lauren-frayer", "title": "Lauren Frayer", "seendate": "20230326T130240Z", "socialimage": "https://media.npr.org/assets/img/2022/05/24/lauren-frayer-headshot_vert-633a43936d9726bbf235ad789b42c7ee61eaaca9.jpg", "domain": "radio.wpsu.org", "language": "ENGLISH", "isquote": 0, "sentence": "Lauren Frayer covers India for NPR News. In June 2018, she opened a new NPR bureau in India's biggest city, its financial center, and the heart of Bollywood—Mumbai.", "context": "Lauren Frayer covers India for NPR News. In June 2018, she opened a new NPR bureau in India's biggest city, its financial center, and the heart of Bollywood—Mumbai. Before moving to India, Lauren was a regular freelance contributor to NPR for seven years, based in Madrid."}, {"url": "https://www.telegraphindia.com/india/indian-space-research-organisation-scientists-reaps-success-with-lvm3-m3-oneweb-india-2-mission/cid/1925160", "title": "OneWeb - Indian Space Research Organisation scientists reaps success with LVM3-M3/OneWeb India-2 mission", "seendate": "20230326T130238Z", "socialimage": "https://assets.telegraphindia.com/telegraph/2023/Mar/1679826322_lvm-3.jpg", "domain": "telegraphindia.com", "language": "ENGLISH", "isquote": 0, "sentence": "Besides the success of the LVM3-M3/OneWeb India 2 mission, scientists also successfully executed the integration of the rocket under one roof at Satish Dhawan Space Centre, Sriharikota.", "context": "The approvals for Sunday's mission increased the confidence of the scientists, as the GSLV Mk III rocket would be flying in the Gaganyaan mission as well, he said. Besides the success of the LVM3-M3/OneWeb India 2 mission, scientists also successfully executed the integration of the rocket under one roof at Satish Dhawan Space Centre, Sriharikota. LVM3-M3/OneWeb India-2 Mission Director S Mohana Kumar said the assembly of the launch vehicle was done in the newly-built second vehicle assembly building, where the entire vehicle integration was carried out under \"one roof\""}, {"url": "https://www.indiagazette.com/news/273671874/china-bags-eight-golds-at-issf-bhopal-world-cup", "title": "China bags eight golds at ISSF Bhopal World Cup", "seendate": "20230326T130238Z", "socialimage": "", "domain": "indiagazette.com", "language": "ENGLISH", "isquote": 0, "sentence": "NEW DELHI, March 26 (Xinhua) -- China's Zhang Jueming beat two Olympic champions en route to winning his first World Cup title in the men's 25m rapid fire pistol event as the ISSF World Cup in Bhopal, India, concluded on Sunday.", "context": "NEW DELHI, March 26 (Xinhua) -- China's Zhang Jueming beat two Olympic champions en route to winning his first World Cup title in the men's 25m rapid fire pistol event as the ISSF World Cup in Bhopal, India, concluded on Sunday. Zhang Qiongyue was victorious in the women's 50m rifle 3 positions, contributing to China's dominating position on the medal tally with eight gold, two silver and two bronze medals from 10 events."}, {"url": "https://www.indiagazette.com/news/273672016/west-bengal-27-injured-as-bus-oil-tanker-collide-on-haldia-mecheda-highway", "title": "West Bengal: 27 injured as bus, oil tanker collide on Haldia-Mecheda Highway", "seendate": "20230326T130237Z", "socialimage": "https://cdn.bignewsnetwork.com/ani1679832579.jpg", "domain": "indiagazette.com", "language": "ENGLISH", "isquote": 0, "sentence": "Purba Medinipur (West Bengal) [India], March 26 (ANI): At least 27 passengers sustained injuries when the bus they were travelling in collided with an oil tanker on the Haldia Mecheda State Highway in West Bengal's Purba Medinipur on Sunday.", "context": "Purba Medinipur (West Bengal) [India], March 26 (ANI): At least 27 passengers sustained injuries when the bus they were travelling in collided with an oil tanker on the Haldia Mecheda State Highway in West Bengal's Purba Medinipur on Sunday. All injured passengers were rushed to the Tomluk Medical College where 12 passengers were administered first aid and discharged and 15 others are still under treatment for their serious injuries."}, {"url": "https://www.freepressjournal.in/mumbai/if-mumbaikars-want-railways-will-run-metro-version-of-vande-bharat-in-city-ashwini-vaishnaw", "title": "If Mumbaikars want, Railways will run metro version of Vande Bharat in city: Ashwini Vaishnaw", "seendate": "20230326T130237Z", "socialimage": "https://gumlet.assettype.com/freepressjournal/2023-03/79a7ee18-c9bc-4131-aaf6-501a5c80859a/IMG_20221007_WA0012__2_.jpg?rect=0%2C0%2C3900%2C2048&auto=format%2Ccompress&ogImage=true", "domain": "freepressjournal.in", "language": "ENGLISH", "isquote": 1, "sentence": "\"'Made in India' Vande Metro trains would be ready to roll out by 2024; if Mumbaikars want, we will introduce it in the suburban section of Mumbai too,\"", "context": "\"'Made in India' Vande Metro trains would be ready to roll out by 2024; if Mumbaikars want, we will introduce it in the suburban section of Mumbai too,\" said Ashwini Vaishnaw, Minister of Railways, Communications, Electronics, and Information Technology, on Sunday in Jammu."}, {"url": "https://www.telegraphindia.com/business/resrve-bank-of-india-may-go-in-for-25-basis-point-interest-rate-hike-in-monetary-policy-meet-next-month-say-experts/cid/1925149", "title": "Interest rate - Resrve Bank of India may go in for 25 basis point interest rate hike in monetary policy meet next month, say experts", "seendate": "20230326T130237Z", "socialimage": "https://assets.telegraphindia.com/telegraph/2023/Jan/1672991512_1638734752_06busrbi_3c.jpg", "domain": "telegraphindia.com", "language": "ENGLISH", "isquote": 0, "sentence": "The Reserve Bank on India (RBI) has been raising benchmark rates since May 2022 to contain inflation which has been largely driven by external factors, especially the disruption of the global supply chain following the outbreak of the Russia-Ukraine war.", "context": "The two key factors which the committee will deliberate intensely while firming up the next monetary policy are elevated retail inflation and the recent action taken by central banks of the developed nations especially the US Federal Reserve, European Central Bank and Bank of England. The Reserve Bank on India (RBI) has been raising benchmark rates since May 2022 to contain inflation which has been largely driven by external factors, especially the disruption of the global supply chain following the outbreak of the Russia-Ukraine war. In its last policy meeting held in February, RBI had raised the policy rate or repo by 25 basis points to 6.50 per cent."}, {"url": "https://www.indiagazette.com/news/273671634/uttarakhand-reports-one-covid-death-4-new-cases-in-last-24-hours", "title": "Uttarakhand reports one Covid death, 4 new cases in last 24 hours", "seendate": "20230326T130237Z", "socialimage": "https://cdn.bignewsnetwork.com/ani1679819993.jpg", "domain": "indiagazette.com", "language": "ENGLISH", "isquote": 0, "sentence": "Dehradun (Uttarakhand) [India], March 26 (ANI): After six months, Uttarakhand on Saturday reported one Covid death, at Doon Hospital in Dehradun.", "context": "Dehradun (Uttarakhand) [India], March 26 (ANI): After six months, Uttarakhand on Saturday reported one Covid death, at Doon Hospital in Dehradun. According to the health department, four new cases have been reported in Dehradun on Saturday, with the number of active cases increasing to 12."}, {"url": "https://www.indiagazette.com/news/273672013/man-held-for-cheating-people-on-pretext-of-providing-tour-packages", "title": "Man held for cheating people on pretext of providing tour packages", "seendate": "20230326T130237Z", "socialimage": "https://cdn.bignewsnetwork.com/ani1679832213.jpg", "domain": "indiagazette.com", "language": "ENGLISH", "isquote": 0, "sentence": "New Delhi [India], March 26 (ANI): Delhi police apprehended a man on Sunday who allegedly cheated people in the name of providing pocket friendly Vaishno Devi tour packages.", "context": "New Delhi [India], March 26 (ANI): Delhi police apprehended a man on Sunday who allegedly cheated people in the name of providing pocket friendly Vaishno Devi tour packages. Police said the accused has been identified as Madhur Kumar."}, {"url": "https://www.telegraphindia.com/india/indian-space-research-organisations-lvm3-completes-onewebs-constellation-of-618-satellites-for-global-space-based-internet/cid/1925165", "title": "OneWeb - Indian Space Research Organisations LVM3 completes OneWebs constellation of 618 satellites for global space-based internet", "seendate": "20230326T130236Z", "socialimage": "https://assets.telegraphindia.com/telegraph/2023/Mar/1679826322_lvm-3.jpg", "domain": "telegraphindia.com", "language": "ENGLISH", "isquote": 1, "sentence": "\"I am particularly proud that OneWeb has crossed the threshold to be able to provide its global coverage in India,\"", "context": "The first batch of 36 OneWeb satellites was launched from Sriharikota on October 23 last year. \"I am particularly proud that OneWeb has crossed the threshold to be able to provide its global coverage in India,\" Sunil Bharti Mittal, Executive Chairman of One Web said."}, {"url": "https://www.livemint.com/news/india/delhi-hospitals-conduct-covid-19-mock-drill-as-city-sees-sharp-rise-in-cases-11679825250007.html", "title": "Delhi hospitals conduct Covid-19 mock drill as city sees sharp rise in cases", "seendate": "20230326T130236Z", "socialimage": "https://www.livemint.com/lm-img/img/2023/03/26/600x338/FsImhOtWwAMGhE7_1679828695246_1679828702007_1679828702007.png", "domain": "livemint.com", "language": "ENGLISH", "isquote": 0, "sentence": "Meanwhile, India on Sunday recorded 1,890 new cases of Covid-19 in the last 24 hours, a press release issued by the Union Ministry of Health and Family Welfare said on Sunday.", "context": "A joint advisory issued by the Union Health Ministry and the Indian Council of Medical Research (ICMR) read that both public and private health facilities in all districts are likely to take part in the exercise to assess the availability of medicines, hospital beds, medical equipment, and medical oxygen. Meanwhile, India on Sunday recorded 1,890 new cases of Covid-19 in the last 24 hours, a press release issued by the Union Ministry of Health and Family Welfare said on Sunday. The Health Ministry said that India's active caseload currently stands at 9,433."}, {"url": "https://www.telegraphindia.com/my-kolkata/events/sundeep-bhutoria-attends-the-sacred-spirit-festival-at-a-historic-fort-in-nagaur-rajasthan/cid/1925172", "title": "Music festival - Sundeep Bhutoria attends the Sacred Spirit Festival at a historic fort in Nagaur, Rajasthan", "seendate": "20230326T130236Z", "socialimage": "https://assets.telegraphindia.com/telegraph/2023/Mar/1679829679_the-author-at-nagaur.jpg", "domain": "telegraphindia.com", "language": "ENGLISH", "isquote": 0, "sentence": "ADVERTISEMENT Among ticketed events in India, it does not get much more exclusive than this festival.", "context": "The event started 17 years ago, and barring two Covid-induced interruptions, has been held every year. ADVERTISEMENT Among ticketed events in India, it does not get much more exclusive than this festival. Only a handful of seats are available to outsiders after providing tickets to the residents of the fort, who too are not many, occupying only about 30 rooms plus luxury tents set up during the event."}, {"url": "https://www.msn.com/en-ca/money/topstories/apple-ceo-praises-china-s-innovation-long-history-of-cooperation-on-beijing-visit/ar-AA195zxR", "title": "Apple CEO praises Chinas innovation, long history of cooperation on Beijing visit", "seendate": "20230326T130233Z", "socialimage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA195ISe.img?&m=6&q=60&o=t&l=f&f=jpg&x=370&y=204", "domain": "msn.com", "language": "ENGLISH", "isquote": 0, "sentence": "His visit comes at a time of rising tensions between Beijing and Washington and as Apple has been looking to reduce its supply chain reliance on China and moving production to new up and coming centres such as India.", "context": "Cook was quoted by The Paper news outlet as saying. His visit comes at a time of rising tensions between Beijing and Washington and as Apple has been looking to reduce its supply chain reliance on China and moving production to new up and coming centres such as India. Last year, production at the world's largest iPhone factory run by Apple supplier Foxconn was heavily disrupted after China's zero-COVID policies fuelled worker unrest."}, {"url": "https://www.military-history.org/behind-the-image/behind-the-image-churchill-visits-the-docks.htm", "title": "BEHIND THE IMAGE: Churchill visits the docks | Military History Matters", "seendate": "20230326T130232Z", "socialimage": "https://i0.wp.com/www.military-history.org/wp-content/uploads/2020/09/Churchill-at-the-docks-1.jpg?fit=702%2C468&ssl=1", "domain": "military-history.org", "language": "ENGLISH", "isquote": 0, "sentence": "Over 25,000 German bombs fell on the area during the war, causing immense damage, particularly to the West India and St Katherine's yards.", "context": "But this also made them a key target for enemy attack. Over 25,000 German bombs fell on the area during the war, causing immense damage, particularly to the West India and St Katherine's yards. But the campaign failed in its ultimate objective to strong-arm the country into surrender."}, {"url": "https://www.indiagazette.com/news/273671939/chirag-shetty-satwiksairaj-rankireddy-win-swiss-open-men-doubles-crown", "title": "Chirag Shetty-Satwiksairaj Rankireddy win Swiss Open mens doubles crown", "seendate": "20230326T130232Z", "socialimage": "https://cdn.bignewsnetwork.com/ani1679831204.jpg", "domain": "indiagazette.com", "language": "ENGLISH", "isquote": 0, "sentence": "Chirag and Satwiksairaj downed the Malaysian pair of Ong Yew Sin and Teo Ee Yi. The world number six India doubles pair defeated their world number eight opponents by 21-19, 17-21, 21-17 in a highly-competitive semi-final match to seal their spot in the summit clash of the BWF Super 300 tournament.", "context": "Earlier on Saturday, Shetty and Rankireddy advanced to the final of the ongoing Swiss Open 2023. Chirag and Satwiksairaj downed the Malaysian pair of Ong Yew Sin and Teo Ee Yi. The world number six India doubles pair defeated their world number eight opponents by 21-19, 17-21, 21-17 in a highly-competitive semi-final match to seal their spot in the summit clash of the BWF Super 300 tournament. Shetty and Satwiksairaj Rankireddy's previous Badminton World Federation titles came at the French Open 2022 BWF Super 750 tournament in October."}, {"url": "https://www.marketwatch.com/press-release/role-playing-games-market-size-with-a-cagr-of-74-offers-current-development-avg-selling-price-global-market-sales-volume-2023-03-26", "title": "Role-playing Games market size with a CAGR of 7.4% offers Current development, avg. selling price, Global Market Sales Volume.", "seendate": "20230326T130232Z", "socialimage": "", "domain": "marketwatch.com", "language": "ENGLISH", "isquote": 0, "sentence": "Some of the fast-growing countries in the RPG market include Japan, India, South Korea, and Brazil.", "context": "Europe is also witnessing a surge in RPG game popularity due to the growing availability of online platforms and the rise in the number of gaming enthusiasts. Some of the fast-growing countries in the RPG market include Japan, India, South Korea, and Brazil. Japan is witnessing an upsurge in the sale of console-based RPG games, whereas India has a growing mobile gaming market."}, {"url": "https://freerepublic.com/tag/*/index?more=4140887", "title": "Latest Articles", "seendate": "20230326T130231Z", "socialimage": "", "domain": "freerepublic.com", "language": "ENGLISH", "isquote": 0, "sentence": "· by familyop · 2 replies TheDefensePost ^ | MARCH 24, 2023 | JOE SABALLA Russia cannot meet its arms delivery commitments to India because of its ongoing invasion of Ukraine, according to the Indian Air Force (AIF).", "context": "The criminal complaint does not say what tipped off Dutch intelligence to Cherkasov's alleged espionage. · by familyop · 2 replies TheDefensePost ^ | MARCH 24, 2023 | JOE SABALLA Russia cannot meet its arms delivery commitments to India because of its ongoing invasion of Ukraine, according to the Indian Air Force (AIF). The statement, aired during a parliamentary committee meeting earlier this week, was the first official confirmation from New Delhi of Moscow's defense export shortfalls."}, {"url": "https://fhmindia.com/oscar-2023-nominations-three-indian-films-are-nominated-for-oscar-including-rrr/", "title": "Oscar 2023 Nominations: Three Indian Films Are Nominated for Oscar Including RRR → FHM India", "seendate": "20230326T130230Z", "socialimage": "", "domain": "fhmindia.com", "language": "ENGLISH", "isquote": 0, "sentence": "India has scored three nominations in the 95th Academy Awards or Oscar Awards 2023.", "context": "A Big day for Indian Cinema. India has scored three nominations in the 95th Academy Awards or Oscar Awards 2023. The final nominations for the 95th Academy awards were announced on Tuesday."}, {"url": "https://www.zerohedge.com/geopolitical/eurasian-integration-including-iran-proceeds-despite-us-maximum-pressure-campaign", "title": "Eurasian Integration Including Iran Proceeds Despite US Maximum Pressure Campaign", "seendate": "20230326T130229Z", "socialimage": "https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2023-03/2023-03-25_12-55-07.jpg?f4b0ec&itok=IY0xyo2R", "domain": "zerohedge.com", "language": "ENGLISH", "isquote": 0, "sentence": "Iran is eager to cash in on its position between India and Russia, who are rapidly increasing their trade volume.", "context": "Despite all the sanctions and western pressure on countries to isolate Moscow, Russian trade is on the upswing. Iran is eager to cash in on its position between India and Russia, who are rapidly increasing their trade volume. From India Shipping News: Ruscon, a leading multimodal transport logistics provider in Russia, has significantly expanded its containerized service network from the Black Sea Port of Novorossiysk to Nhava Sheva and Mundra in west India as volumes rapidly rise."}, {"url": "https://www.indiagazette.com/news/273671672/india-us-japan-secure-usd-2286-bn-imf-bailout-for-sri-lanka", "title": "India, US, Japan secure USD 2.286 bn IMF bailout for Sri Lanka", "seendate": "20230326T130228Z", "socialimage": "https://cdn.bignewsnetwork.com/ani1679823592.jpg", "domain": "indiagazette.com", "language": "ENGLISH", "isquote": 0, "sentence": "Colombo [Sri Lanka], March 26 (ANI): After a protracted battle by India, the United States and Japan to get China to agree to restructure its massive loan of USD 7 bn to Sri Lanka, the International Monetary Fund (IMF) approved a USD 2.286 billion bailout for Sri Lanka on March 20.", "context": "Colombo [Sri Lanka], March 26 (ANI): After a protracted battle by India, the United States and Japan to get China to agree to restructure its massive loan of USD 7 bn to Sri Lanka, the International Monetary Fund (IMF) approved a USD 2.286 billion bailout for Sri Lanka on March 20. The Sri Lankan government under President Ranil Wickremesinghe endorsed on Saturday that Sri Lanka is no longer deemed bankrupt by the world, Trueceylon reported."}, {"url": "https://www.telegraphindia.com/feeds/india/bangladesh-mp-bats-for-border-hospitals-on-lines-of-border-haats/cid/1925174", "title": "hospitals - Bangladesh MP bats for border hospitals on lines of border haats", "seendate": "20230326T130226Z", "socialimage": "https://assets.telegraphindia.com/telegraph/2023/Mar/1679831790_border.jpg", "domain": "telegraphindia.com", "language": "ENGLISH", "isquote": 1, "sentence": "I have proposed this idea in different forums of India and Bangladesh,\"", "context": "Both governments can start work on it. I have proposed this idea in different forums of India and Bangladesh,\" he told PTI."}, {"url": "https://www.neworleanssun.com/news/273671656/odisha-jana-jati-outfit-holds-rally-in-bhubaneswar-demands-removal-of-st-status-of-converted-tribals", "title": "Odisha: Jana Jati outfit holds rally in Bhubaneswar, demands removal of ST status of converted tribals", "seendate": "20230326T130226Z", "socialimage": "https://cdn.bignewsnetwork.com/ani1679822716.jpg", "domain": "neworleanssun.com", "language": "ENGLISH", "isquote": 0, "sentence": "Bhubaneswar (Odisha) [India], March 26 (ANI): Thousands of tribals from all 62 tribes of Odisha under the banner of Odisha Jana Jati Suraksha Manch took out a massive rally in Bhubaneswar on Saturday demanding exclusion of tribes, who have converted to other religions, from the Scheduled Tribe (ST) list.", "context": "Bhubaneswar (Odisha) [India], March 26 (ANI): Thousands of tribals from all 62 tribes of Odisha under the banner of Odisha Jana Jati Suraksha Manch took out a massive rally in Bhubaneswar on Saturday demanding exclusion of tribes, who have converted to other religions, from the Scheduled Tribe (ST) list. Donning their traditional attire, thousands of tribes from all 30 districts of Odisha took out three tribal rallies from Ram Mandir Square, Shaheed nagar and Nayapally Durgamandap in the capital city."}, {"url": "https://timesofindia.indiatimes.com/india/jail-me-if-you-want-but-the-countrys-pm-is-a-coward-priyanka-gandhi-vadra/articleshow/99013083.cms", "title": "Jail me if you want, but the countrys PM is a coward: Priyanka Gandhi Vadra | India News", "seendate": "20230326T130225Z", "socialimage": "https://static.toiimg.com/thumb/msid-99013359,width-1070,height-580,imgsize-1095729,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "domain": "timesofindia.indiatimes.com", "language": "ENGLISH", "isquote": 0, "sentence": "Kharge, meanwhile, asserted that Rahul Gandhi has been taking up for the rights of common people in India and asked why the PM and BJP are panicking when Rahul asks questions about fugitives and those defrauding the Indian people.", "context": "she added. Kharge, meanwhile, asserted that Rahul Gandhi has been taking up for the rights of common people in India and asked why the PM and BJP are panicking when Rahul asks questions about fugitives and those defrauding the Indian people. Accusing the PM of using objectionable language against the Gandhi family and Congress, for which defamation cases should be filed against him, Kharge also alleged Modi of equating Indian people with \"dogs\"."}, {"url": "https://www.indiagazette.com/news/273671941/bwf-sudirman-cup-india-draw-with-malaysia-chinese-taipei-australia-in-group-c", "title": "BWF Sudirman Cup: India draw with Malaysia, Chinese Taipei, Australia in Group C", "seendate": "20230326T130225Z", "socialimage": "https://cdn.bignewsnetwork.com/ani1679831225.jpg", "domain": "indiagazette.com", "language": "ENGLISH", "isquote": 0, "sentence": "By winning the bronze medal at the Badminton Asia Mixed Team Championships last month, India earned a spot in the Sudirman Cup in 2023.", "context": "The defending Commonwealth Games winners Satwiksairaj Rankireddy-Chirag Shetty, PV Sindhu, Lakshya Sen, and the rising women's doubles team of Gayatri Gopichand-Treesa Jolly will be counted on to lead India's challenge in Suzhou. By winning the bronze medal at the Badminton Asia Mixed Team Championships last month, India earned a spot in the Sudirman Cup in 2023. India will face Malaysia in the group round of the Badminton Asia Mixed Team Championships since the two nations have met before."}]}